"""Створення двох зміннх для збереження значень типу "ціле число" для збереження
кількості учнів та кількості яблук, користувач має ввести з клавіатури два числа"""
pupils = int(input("Введіть кількість учнів: "))
apple = int(input("Ведіть скільки яблук у кошику: "))


#Розділення яблук порівно між учнями
ApplesForAll = apple // pupils
#Знаходження залишку яблук у кошику
ApplesInABasket = apple % pupils

#Виведення результатів в консоль
print(f"Учні отримали по {ApplesForAll} яблук(а)")
print(f"У кошику лишилося {ApplesInABasket} яблук(а)")
