#Створення змінно типу "рядок", для збереження значень двох слів
Main_string = list(input("Чи співпадає перша буква першого слова з останньою буквою другого слова?\nВведіть два слова через пробіл: "))

#Створення змінної типу "ціле число", для збереження значення розмірності рядка
lenght_str = len(Main_string)

#Створення змінної типу "рядок", для збереження значення першого символу першого слова
First_letter = Main_string[0].lower()

#Створення змінної типу "рядок", для збереження значення останнього символу другого слова
Second_letter = Main_string[lenght_str-1].lower()

#Використання оператора "in", для перевірки двох послідовностей First_letter та Second_letter. Виведеня результату
print(First_letter in Second_letter)